app/views/users/show.html.erb

<ul id="user_questions">
  <% @user.questions.each do |question| %>
---
SELECT "questions".* FROM "questions"  WHERE "questions"."user_id" = $1  [["user_id", 5]]