app/controllers/answers_controller.rb

  def new
    @question = Question.find(params[:question_id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 47]]

  def create
    @answer = Answer.new(answer_params)
    @question = Question.find(params[:question_id])
    @user = User.find(@question.user_id)
    @answer.question_id = @question.id
    @answer.user_id = @user.id

    if @answer.save
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 50]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]
INSERT INTO "answers" ("answer", "created_at", "question_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer", "I like cupcakes!"], ["created_at", "2014-09-04 18:43:38.744385"], ["question_id", 49], ["updated_at", "2014-09-04 18:43:38.744385"], ["user_id", 4]]