app/controllers/questions_controller.rb

  def index
    @questions = Question.all.order(:created_at)
---
SELECT "questions".* FROM "questions"   ORDER BY "questions"."created_at" ASC