app/controllers/questions_controller.rb

  def create
    @questions = Question.all
    @question = Question.new(question_params)
    @user = User.find(params[:user_id])
    if @question.save
---
SELECT "questions".* FROM "questions"
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]
INSERT INTO "questions" ("created_at", "question", "subject", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-09-04 16:19:52.709992"], ["question", "I'm just full of them!"], ["subject", "another question"], ["updated_at", "2014-09-04 16:19:52.709992"], ["user_id", 5]]

  def show
    @question = Question.find(params[:id])
    @user = User.find(params[:user_id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 41]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]

  def edit
    @question = Question.find(params[:id])
    @user = User.find(params[:user_id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 45]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]

  def update
    @question = Question.find(params[:id])
    @user = User.find(params[:user_id])
    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 45]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "questions" SET "question" = $1, "subject" = $2, "updated_at" = $3 WHERE "questions"."id" = 45  [["question", "Weil ich liebe kartoffelpuffer."], ["subject", "Warum isst du das?"], ["updated_at", "2014-09-04 17:18:24.636820"]]

  def destroy
    Question.find(params[:id]).destroy
---
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 45]]
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 45]]