app/controllers/users_controller.rb

SELECT "users".* FROM "users"   ORDER BY "users"."name" ASC
---
  def index
    @users = User.all.order(:name)

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save